app/workers/chat_worker.rb

INSERT INTO `chats` (`number`, `created_at`, `updated_at`, `application_id`) VALUES (8, '2021-03-24 00:24:19', '2021-03-24 00:24:19', 4)
---
    def perform(app_id, num)
        chat = Chat.new(application_id: app_id, number: num)
        chat.save!