app/workers/message_worker.rb

    def perform(id, num, text)
        message = Message.new(chat_id: id, number: num, body: text )
        message.save!
---
INSERT INTO `messages` (`number`, `body`, `created_at`, `updated_at`, `chat_id`) VALUES (1, 'I want to sleep', '2021-03-24 00:31:45', '2021-03-24 00:31:45', 9)