app/controllers/api/v1/applications_controller.rb

SELECT `applications`.* FROM `applications`
---
      def index
        @applications = Application.all

INSERT INTO `applications` (`acess_token`, `name`, `created_at`, `updated_at`) VALUES ('mRuNm1qoiTPAkAeXyZGtP8xt', 'google', '2021-03-21 23:43:06', '2021-03-21 23:43:06')
---
      def create
        @application = Application.new(application_params)

        if @application.save