app/controllers/api/v1/chats_controller.rb

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` IS NULL
---
      def index
        @chats = Chat.where(application: @application.id)