app/controllers/api/v1/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 3
---
      def index
        @q = params.fetch(:search_query) if params[:search_query]
        if @q
          @messages = Message.search(@q, fields: ['body'], where: {chat_id: @chat.id})
          render json: @messages, :except => [:id, :chat_id]
        else
          @messages = Message.where(chat_id: @chat.id)