app/models/application.rb

  def self.cached_app(token)
    Rails.cache.fetch(token, expires_in: 1.hour){
      Application.find_by(acess_token: token)
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`acess_token` = '8znQ1KG6LQAgjnsKfgqha92A' LIMIT 1