app/models/chat.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`application_id` = 3 AND `chats`.`number` IS NULL ORDER BY `chats`.`id` ASC LIMIT 1
---
    def self.find_chat(token, id)
        app = Application.cached_app(token)
        Rails.cache.fetch("#{token}|#{id}", expires_in: 1.hour){
            Chat.where(application_id: app.id, number: id).first